rs-programmer/stm32h743vit6/Middlewares/Third_Party/FMC/LCD/lcd.c
/**
 ****************************************************************************************************
 * @file        lcd.c
 * @version     V1.0
 * @brief       2.8寸/3.5寸/4.3寸 TFTLCD(MCU屏) 驱动代码
 *              支持驱动IC型号包括:NT35310/NT35510/ST7796/ST7789
 ****************************************************************************************************
 * @attention   Waiken-Smart 慧勤智远
 *
 * 实验平台:    STM32H743VIT6小系统板
 *
 ****************************************************************************************************
 */
#include "lcd.h"
#if (FMC_LCD_MODE_CPU == 1)
/* lcd_ex.c存放各个LCD驱动IC的寄存器初始化部分代码,以简化lcd.c,该.c文件
 * 不直接加入到工程里面,只有lcd.c会用到,所以通过include的形式添加.(不要在
 * 其他文件再包含该.c文件!!否则会报错!)
 */
#include "lcd_ex.c"
#include "stm32h7xx_hal_rcc_ex.h"
#include "lcdfont.h"

SRAM_HandleTypeDef g_sram_handle; /* SRAM句柄(用于控制LCD) */

/* LCD的画笔颜色和背景色 */
uint32_t g_point_color = 0XF800; /* 画笔颜色 */
uint32_t g_back_color = 0XFFFF;  /* 背景色 */

/* 管理LCD重要参数 */
_lcd_dev lcddev;

/**
 * @brief       LCD写数据
 * @param       data: 要写入的数据
 * @retval      无
 */
void LCD_WriteData(volatile uint16_t data)
{
    data = data; /* 使用-O2优化的时候,必须插入的延时 */
    LCD->LCD_RAM = data;
}

/**
 * @brief       LCD写寄存器编号/地址函数
 * @param       regno: 寄存器编号/地址
 * @retval      无
 */
void LCD_WriteReg(volatile uint16_t regno)
{
    regno = regno;        /* 使用-O2优化的时候,必须插入的延时 */
    LCD->LCD_REG = regno; /* 写入要写的寄存器序号 */
}

/**
 * @brief       LCD写寄存器
 * @param       regno:寄存器编号/地址
 * @param       data:要写入的数据
 * @retval      无
 */
void LCD_Write(uint16_t regno, uint16_t data)
{
    LCD->LCD_REG = regno; /* 写入要写的寄存器序号 */
    LCD->LCD_RAM = data;  /* 写入数据 */
}

/**
 * @brief       LCD读数据
 * @param       无
 * @retval      读取到的数据
 */
static uint16_t LCD_ReadData(void)
{
    volatile uint16_t ram; /* 防止被优化 */
    ram = LCD->LCD_RAM;
    return ram;
}

/**
 * @brief       LCD延时函数,仅用于部分在mdk -O1时间优化时需要设置的地方
 * @param       i:延时的数值
 * @retval      无
 */
static void LCD_Delay(uint32_t i)
{
    while (i--)
        ; /* 使用AC6时空循环可能被优化,可使用while(1) __asm volatile(""); */
}

/**
 * @brief       准备写GRAM
 * @param       无
 * @retval      无
 */
void LCD_WritePrepare(void)
{
    LCD->LCD_REG = lcddev.wramcmd;
}

/**
 * @brief       读取某个点的颜色值
 * @param       x,y:坐标
 * @retval      此点的颜色
 */
uint32_t LCD_ReadPoint(uint16_t x, uint16_t y)
{
    uint16_t r = 0, g = 0, b = 0;

    if (x >= lcddev.width || y >= lcddev.height)
    {
        return 0; /* 超过了范围,直接返回 */
    }

    LCD_SetCursor(x, y); /* 设置坐标 */

    if (lcddev.id == 0x5510)
    {
        LCD_WriteReg(0x2E00); /* 5510 发送读GRAM指令 */
    }
    else
    {
        LCD_WriteReg(0x2E); /* 其他IC(7796/5310/7789)发送读GRAM指令 */
    }

    r = LCD_ReadData(); /* 假读(dummy read) */

    LCD_Delay(2);
    r = LCD_ReadData(); /* 实际坐标颜色 */

    if (lcddev.id == 0x7796) /* 7796 一次读取一个像素值 */
    {
        return r;
    }

    /* 5310/5510/7789 要分2次读出 */
    LCD_Delay(2);
    b = LCD_ReadData();
    g = r & 0XFF; /* 对于 5310/5510/7789, 第一次读取的是RG的值,R在前,G在后,各占8位 */
    g <<= 8;

    return (((r >> 11) << 11) | ((g >> 10) << 5) | (b >> 11)); /* 5310/5510/7789 需要公式转换一下 */
}

/**
 * @brief       LCD开启显示
 * @param       无
 * @retval      无
 */
void LCD_DisplayOn(void)
{
    if (lcddev.id == 0X5510) /* 5510开启显示指令 */
    {
        LCD_WriteReg(0X2900); /* 开启显示 */
    }
    else /* 5310/7789/7796 等发送开启显示指令 */
    {
        LCD_WriteReg(0X29); /* 开启显示 */
    }
}

/**
 * @brief       LCD关闭显示
 * @param       无
 * @retval      无
 */
void LCD_DisplayOff(void)
{
    if (lcddev.id == 0X5510) /* 5510关闭显示指令 */
    {
        LCD_WriteReg(0X2800); /* 关闭显示 */
    }
    else /* 5310/7789/7796 等发送开启显示指令 */
    {
        LCD_WriteReg(0X28); /* 关闭显示 */
    }
}

/**
 * @brief       设置光标位置
 * @param       x,y: 坐标
 * @retval      无
 */
void LCD_SetCursor(uint16_t x, uint16_t y)
{
    if (lcddev.id == 0X5510) /* 5510设置坐标 */
    {
        LCD_WriteReg(lcddev.setxcmd);
        LCD_WriteData(x >> 8);
        LCD_WriteReg(lcddev.setxcmd + 1);
        LCD_WriteData(x & 0XFF);
        LCD_WriteReg(lcddev.setycmd);
        LCD_WriteData(y >> 8);
        LCD_WriteReg(lcddev.setycmd + 1);
        LCD_WriteData(y & 0XFF);
    }
    else /* 5310/7789/7796设置坐标 */
    {
        LCD_WriteReg(lcddev.setxcmd);
        LCD_WriteData(x >> 8);
        LCD_WriteData(x & 0XFF);
        LCD_WriteReg(lcddev.setycmd);
        LCD_WriteData(y >> 8);
        LCD_WriteData(y & 0XFF);
    }
}

/**
 * @brief       设置LCD的自动扫描方向
 * @note
 *              注意:其他函数可能会受到此函数设置的影响,
 *              所以,一般设置为L2R_U2D即可,如果设置为其他扫描方式,可能导致显示不正常.
 *
 * @param       dir:0~7,代表8个方向(具体定义见lcd.h)
 * @retval      无
 */
void LCD_ScanDir(uint8_t dir)
{
    uint16_t regval = 0;
    uint16_t dirreg = 0;
    uint16_t temp;

    /* 横屏时，IC改变扫描方向！竖屏时, IC不改变扫描方向 */
    if (lcddev.dir == 1)
    {
        switch (dir) /* 方向转换 */
        {
        case 0:
            dir = 6;
            break;

        case 1:
            dir = 7;
            break;

        case 2:
            dir = 4;
            break;

        case 3:
            dir = 5;
            break;

        case 4:
            dir = 1;
            break;

        case 5:
            dir = 0;
            break;

        case 6:
            dir = 3;
            break;

        case 7:
            dir = 2;
            break;
        }
    }

    /* 根据扫描方式 设置 0X36/0X3600 寄存器 bit 5,6,7 位的值 */
    switch (dir)
    {
    case L2R_U2D: /* 从左到右,从上到下 */
        regval |= (0 << 7) | (0 << 6) | (0 << 5);
        break;

    case L2R_D2U: /* 从左到右,从下到上 */
        regval |= (1 << 7) | (0 << 6) | (0 << 5);
        break;

    case R2L_U2D: /* 从右到左,从上到下 */
        regval |= (0 << 7) | (1 << 6) | (0 << 5);
        break;

    case R2L_D2U: /* 从右到左,从下到上 */
        regval |= (1 << 7) | (1 << 6) | (0 << 5);
        break;

    case U2D_L2R: /* 从上到下,从左到右 */
        regval |= (0 << 7) | (0 << 6) | (1 << 5);
        break;

    case U2D_R2L: /* 从上到下,从右到左 */
        regval |= (0 << 7) | (1 << 6) | (1 << 5);
        break;

    case D2U_L2R: /* 从下到上,从左到右 */
        regval |= (1 << 7) | (0 << 6) | (1 << 5);
        break;

